
#Область Задача1
	// Реализовать функцию, которая возвращает по переданной дате день недели
	// "пн" = ДеньНеделиПоДате("01.05.2023")
	// "вт" = ДеньНеделиПоДате("02.05.2023")
	
#КонецОбласти



#Область Задача2
// счастливый билетик - это билет, у которого сумма первых трёх чисел
// равна сумме вторых трёх чисел
// Реализовать функцию ЭтоСчастливыйБилетик, проверяющего счастливый билет или нет
// Пример счастливого билета 625256 ( 6 + 2 + 5 = 2 + 5 + 6)
// Истина = ЭтоСчастливыйБилетик("625526")
#КонецОбласти

#Область Задача3
// Числа Фибоначчи - элементы числовой последовательности, в которой первые два числа равны 0 и 1,
// а каждое последующее число равно сумме двух предыдущих чисел
// Реализуйте функцию, которая рассчитывает N-е число последовательности
// 1 = Фибоначчи(3)
#КонецОбласти

#Область Задача4
// В строке находится словарь Ожегова
// Требуется реализовать функцию, которая осуществляет поиск количества вхождений в словаре переданной строки
// регистр слов учитываться не должен
// ЧислоВхожденийСтроки("монастырь") = 2
// TODO реализовать функционал
#КонецОбласти



#Область Задача5
	// Реализуйте функцию проверки формата e-mail адреса
	// Истина = ВалидацияПройдена("a.plastinin@gmail.com")
	// Ложь = ВалидацияПройдена("что здесь происходит?")
	// Ложь = ВалидацияПройдена("а.пластинин@почта@.com?")
#КонецОбласти
// FIXME проверить корректность алгоритма


#Область Задача6
// создайте функцию, которая проверит сортировку значений в переданном массиве
// Направление сортировки - Возрастание
// Истина = МассивОтсортирован([1,1,2,4,6])
// Ложь = МассивОтсортирован([4,1,6,4,6])
// Истина = МассивОтсортирован([а,б,в,д])
#КонецОбласти

#Область Задача7
// Создайте функцию, которая определит самый популярный элемент в массиве
// 1 = ПолучитьСамыйПопулярныйЭлементВМассиве([1,2,3,3,1,1,4,5,6])
#КонецОбласти

#Область Задача8
// А - 1, Б - 2, В - 3
//Реализовать функцию, которая осуществляет расчет переданной строки
// 30 = СуммаСтроки("Мама")
//Функция СуммаСтроки(Строка)
//	Алфафит = " АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ"
//	
//	Возврат 0;	
//КонецФункции

#КонецОбласти

#Область Задача9
// создайте функцию, которая удаляет дубликаты элементов в массиве
// [1,2] = ПолучитьМножествоИзМассива([1,1,2,2,1])
#КонецОбласти